In [99]:
import pandas as pd

from sklearn.linear_model import LogisticRegression
import numpy as np

In [107]:
x=pd.read_csv("titanicset.csv")
x.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [108]:
x.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [109]:
data1=pd.get_dummies(x,columns=["Sex","Embarked"])
data1

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,892,0,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,0,1,0,1,0
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,1,0,0,0,1
2,894,0,2,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,0,1,0,1,0
3,895,0,3,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,0,1,0,0,1
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",NaN,0,0,A.5. 3236,8.0500,NaN,0,1,0,0,1
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",39.0,0,0,PC 17758,108.9000,C105,1,0,1,0,0
415,1307,0,3,"Saether, Mr. Simon Sivertsen",38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,0,1,0,0,1
416,1308,0,3,"Ware, Mr. Frederick",NaN,0,0,359309,8.0500,NaN,0,1,0,0,1
417,1309,0,3,"Peter, Master. Michael J",NaN,1,1,2668,22.3583,NaN,0,1,1,0,0

In [111]:
data1.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Sex_female       0
Sex_male         0
Embarked_C       0
Embarked_Q       0
Embarked_S       0
dtype: int64

In [113]:
data1=data1.drop(["PassengerId","Name","Ticket","Cabin","SibSp","Parch"],axis=1)

In [114]:
data1.head()

,Survived,Pclass,Age,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,34.5,7.8292,0,1,0,1,0
1,1,3,47.0,7.0000,1,0,0,0,1
2,0,2,62.0,9.6875,0,1,0,1,0
3,0,3,27.0,8.6625,0,1,0,0,1
4,1,3,22.0,12.2875,1,0,0,0,1

In [115]:
data1.dtypes

Survived        int64
Pclass          int64
Age           float64
Fare          float64
Sex_female      uint8
Sex_male        uint8
Embarked_C      uint8
Embarked_Q      uint8
Embarked_S      uint8
dtype: object

In [116]:
data1["Age"][:10]

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
5    14.0
6    30.0
7    26.0
8    18.0
9    21.0
Name: Age, dtype: float64

In [117]:
len(data1["Age"])

418

In [118]:
data1.Age=data1.Age.fillna(data1.Age.mean())

In [119]:
data1["Age"][:10]

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
5    14.0
6    30.0
7    26.0
8    18.0
9    21.0
Name: Age, dtype: float64

In [120]:
data1=data1.dropna()

In [121]:
X=data1.iloc[:,1:]
y=data1.iloc[:,0]

In [122]:
from sklearn.preprocessing import StandardScaler

In [123]:
scale=StandardScaler()
standard=scale.fit_transform(X)
X=standard
X

array([[ 0.87532977,  0.34269466, -0.49781052, ..., -0.56904264,
         2.83993264, -1.34817194],
       [ 0.87532977,  1.33892384, -0.51265996, ..., -0.56904264,
        -0.35212103,  0.74174515],
       [-0.31363607,  2.53439885, -0.46453181, ..., -0.56904264,
         2.83993264, -1.34817194],
       ...,
       [ 0.87532977,  0.661488  , -0.50818292, ..., -0.56904264,
        -0.35212103,  0.74174515],
       [ 0.87532977,  0.00577716, -0.4938564 , ..., -0.56904264,
        -0.35212103,  0.74174515],
       [ 0.87532977,  0.00577716, -0.23762123, ...,  1.75733756,
        -0.35212103, -1.34817194]])

In [124]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=10)

In [125]:
X_train.shape,X_test.shape

((333, 8), (84, 8))

In [126]:
from sklearn.tree import DecisionTreeClassifier

In [127]:
model=DecisionTreeClassifier()

In [128]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [130]:
y_pred=model.predict(X_test)
y_pred

array([0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0,
       0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0], dtype=int64)

In [136]:
from sklearn.metrics import accuracy_score
accuracy=accuracy_score(y_test,y_pred)
accuracy

1.0

In [137]:
data1.head()

,Survived,Pclass,Age,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,34.5,7.8292,0,1,0,1,0
1,1,3,47.0,7.0000,1,0,0,0,1
2,0,2,62.0,9.6875,0,1,0,1,0
3,0,3,27.0,8.6625,0,1,0,0,1
4,1,3,22.0,12.2875,1,0,0,0,1

In [140]:
input_data=(3,34,7.8292,0,1,0,1,0)
input_data_numpy=np.array(input_data).reshape(1,-1)
predict_data=model.predict(input_data_numpy)
if predict_data==0:
    print("not eligible to travel in titanic")
else:
    
    print("eligible to travel in titanic")

not eligible to travel in titanic